MESSAGES = {
    # Меню
    "menu": (
        "\nМеню:\n"
        "1. Добавить книгу\n"
        "2. Удалить книгу\n"
        "3. Найти книгу\n"
        "4. Отобразить все книги\n"
        "5. Изменить статус книги\n"
        "6. Выход\n"
    ),
    # Добавление книги
    "add_prompt_title": "\nВведите название книги: ",
    "add_prompt_author": "Введите автора книги: ",
    "add_prompt_year": "Введите год выпуска книги: ",
    "add_year_error": "Введите год выпуска корректно (только цифры).",
    "add_success": "\nКнига успешно добавлена.",

    # Удаление книги
    "delete_prompt_id": "\nВведите ID книги для удаления: ",
    "delete_success": "\nКнига успешно удалена.",
    "delete_fail": "\nКнига с таким ID не найдена.",
    "delete_id_error": "Введите ID корректно (только цифры).",

    # Поиск книги
    "search_prompt": "\nВведите название, автора или год выпуска книги: ",
    "search_not_found": "\nКнига не найдена. Попробуйте ещё раз",

    # Отображение книг
    "no_books": "\nКниг в библиотеке нет.",

    # Изменение статуса
    "status_prompt_id": "\nВведите ID книги для изменения статуса: ",
    "status_prompt_new": "Введите новый статус книги (В наличии или Выдана): ",
    "status_invalid": "\nВведите корректный статус (В наличии или Выдана).",
    "status_success": "\nСтатус книги успешно изменён.",
    "status_fail": "\nКнига с таким ID не найдена.",
    "status_id_error": "Введите ID корректно (только цифры).",

    # Общие ошибки
    "input_error": "Некорректный ввод. Попробуйте снова.",
    "exit": "Выход из программы.",
}
